Repository: open-contracting/pelican-frontend
Catalog: backend/dqt/locale/*/LC_MESSAGES/django.po
Languages: es

# field.exists.description
source: There is one test per possible occurrence of the field. Example: If the parent tender field is set in 10 compiled releases, then the child tender.id field is reported out of 10. If there are 100 entries across all awards arrays in all compiled releases, then the awards.id field is reported out of 100.
es: Hay una prueba por posible aparición del campo. Ejemplo: si el campo padre licitación se establece en 10 compiled releases, el campo hijo tender.id se reporta sobre 10. Si hay 100 entradas en todos los arrays de adjudicación en todos los compiled releases, entonces se reporta el campo awards.id sobre 100.

# field.non_empty.description
source: There is one test per actual occurrence of the field. The test passes if the field value is neither null nor empty (i.e. it is not an empty string, empty array or empty object). See the above check for other details.
es: Hay una prueba por ocurrencia real del campo. La prueba pasa si el valor del campo no es nulo ni está vacío (es decir, no es una cadena vacía, un array vacío o un objeto vacío). Vea la comprobación de arriba para obtener más detalles.

# field.exists.name
source: Field is set
es: El campo está establecido

# field.non_empty.name
source: Field isn't null or empty
es: El campo no es nulo ni está vacío

# field.ocid_prefix_check.name
source: OCID prefix is registered
es: El prefijo OCID está registrado

# field.date_time.name
source: Date is realistic
es: La fecha es realista

# field.email.name
source: Email address is valid
es: La dirección de correo electrónico es válida

# field.identifier_scheme.name
source: Identifier scheme is recognized
es: El esquema del identificador es reconocido

# field.telephone.name
source: Phone number is possible
es: El número de teléfono es posible

# field.document_description_length.name
source: Has 250 characters or less
es: Tiene 250 caracteres o menos

# field.document_type.name
source: Document type is coherent
es: El tipo de documento es coherente

# field.document_format_codelist.name
source: Document format is recognized
es: El formato del documento es reconocido

# field.number_checks.name
source: Number is non-negative
es: El número no es negativo

# field.language.name
source: Language code is recognized
es: El código del idioma es reconocido

# field.ocid_prefix_check.description
source: The value is a string and starts with a registered OCID prefix.
es: El valor es una cadena y comienza con un prefijo OCID registrado.

# field.date_time.description
source: The value is a string, starts in YYYY-MM-DD format, isn't before 1990 and isn't after 2050.
es: El valor es una cadena, comienza en formato AAAA-MM-DD y no es anterior a 1990 ni posterior a 2050.

# field.email.description
source: The value is a valid address according to RFC 2822.
es: El valor es una dirección válida según RFC 2822.

# field.identifier_scheme.description
source: The value is a string and is an org-id.guide code. (The codelist is open.)
es: El valor es una cadena y es un código org-id.guide. (La lista de códigos es abierta.)

# field.telephone.description
source: The value is a possible number according to Google's libphonenumber.
es: El valor es un número posible según la libreria libphonenumber de Google.

# field.document_description_length.description
source: The length of the value is less than or equal to 250.
es: La longitud del valor es menor o igual a 250.

# field.document_type.description
source: The document type is appropriate to the field path. Specifically, the value is a documentType code, and the code's 'Section' corresponds to the field's path. (The codelist is open.)
es: El tipo de documento es apropiado para la ruta del campo. Específicamente, el valor es un código de documentType y la 'Sección' del código corresponde a la ruta del campo. (La lista de códigos es abierta.)

# field.document_format_codelist.description
source: The value is a string and is either an IANA Media Type or the 'offline/print' code. (The codelist is open.)
es: El valor es una cadena y o es un tipo de medio IANA o es el código 'offline/print'. (La lista de códigos es abierta.)

# field.number_checks.description
source: The value isn't a complex number, can be parsed as a floating-point number, and is non-negative.
es: El valor no es un número complejo, puede ser analizado como un número de punto flotante y no es negativo.

# field.language.description
source: The value is a string and is a two-letter, lowercase, ISO 639-1 code. (The codelist is open.)
es: El valor es una cadena y es un código ISO 639-1 de dos letras minúsculas. (La lista de códigos es abierta.)

# resource.coherent.period.name
source: Start dates aren't after end dates
es: Las fechas de inicio no son posteriores a la fechas de fin

# resource.coherent.procurement_method_vs_number_of_tenderers.name
source: At most one tenderer for sole sourcing
es: Como máximo un licitador para la contratación de una sola fuente

# resource.coherent.tender_status.name
source: No awards or contracts for incomplete tenders
es: Sin adjudicaciones o contratos en licitaciones incompletas

# resource.coherent.awards_status.name
source: No contracts for inactive awards
es: Sin contratos en adjudicaciones inactivas

# resource.coherent.contracts_status.name
source: No transactions for unsigned contracts
es: Sin transacciones en contratos no firmados

# resource.coherent.milestone_status.name
source: No date met for unmet milestones
es: Sin fecha de cumplimiento en hitos no cumplidos

# resource.coherent.value_realistic.name
source: Monetary values are realistic
es: Los valores monetarios son realistas

# resource.coherent.dates.name
source: Contracting process timeline
es: Línea de tiempo del proceso de contratación

# resource.coherent.milestones_dates.name
source: Milestone dates
es: Fechas de hito

# resource.coherent.amendments_dates.name
source: Amendment dates
es: Fechas de enmienda

# resource.coherent.documents_dates.name
source: Document dates
es: Fechas de documento

# resource.consistent.number_of_tenderers.name
source: Number of tenderers is consistent
es: El número de oferentes es consistente

# resource.consistent.tender_value.name
source: Planning budget is commensurate with tender value
es: El presupuesto de la planificación está acorde con el valor de la licitación

# resource.consistent.contracts_value.name
source: Contract values are commensurate with award value
es: Los valores del contrato están acordes al valor de la adjudicación

# resource.consistent.contracts_implementation_transactions_value.name
source: Transaction values are commensurate with contract value
es: Los valores de transacción son proporcionales al valor del contrato

# resource.consistent.parties_roles.name
source: Parties are referenced
es: Las partes son referenciadas

# resource.consistent.period_duration_in_days.name
source: Period's duration is consistent with start and end dates
es: La duración del periodo es consistente con la fecha de inicio y fin

# resource.consistent.buyer_in_parties_roles.name
source: Buyer's role is set
es: El rol del comprador está establecido

# resource.consistent.supplier_in_parties_roles.name
source: Supplier's role is set
es: El rol del proveedor está establecido

# resource.consistent.tenderer_in_parties_roles.name
source: Tenderer's role is set
es: El rol del oferente está establecido

# resource.consistent.procuring_entity_in_parties_roles.name
source: Procuring entity's role is set
es: El rol de la entidad contratante está establecido

# resource.consistent.payer_in_parties_roles.name
source: Payer's role is set
es: El rol del pagador está establecido

# resource.consistent.payee_in_parties_roles.name
source: Payee's role is set
es: El rol del beneficiario está establecido

# resource.consistent.buyer_name_in_parties.name
source: Buyer's name is consistent
es: El nombre del comprador es consistente

# resource.consistent.payee_name_in_parties.name
source: Payee's name is consistent
es: El nombre del beneficiario es consistente

# resource.consistent.payer_name_in_parties.name
source: Payer's name is consistent
es: El nombre del pagador es consistente

# resource.consistent.procuring_entity_name_in_parties.name
source: Procuring entity's name is consistent
es: El nombre de la entidad contratante es consistente

# resource.consistent.supplier_name_in_parties.name
source: Supplier's name is consistent
es: El nombre del proveedor es consistente

# resource.consistent.tenderer_name_in_parties.name
source: Tenderer's name is consistent
es: El nombre del oferente es consistente

# resource.reference.buyer_in_parties.name
source: Buyer organization reference
es: Referencia a la organización del comprador

# resource.reference.payee_in_parties.name
source: Payee organization reference
es: Referencia a la organización del beneficiario

# resource.reference.payer_in_parties.name
source: Payer organization reference
es: Referencia a la organización del pagador

# resource.reference.procuring_entity_in_parties.name
source: Procuring entity organization reference
es: Referencia a la organización de la entidad contratante

# resource.reference.supplier_in_parties.name
source: Supplier organization references
es: Referencias a la organización del proveedor

# resource.reference.tenderer_in_parties.name
source: Tenderer organization references
es: Referencias a la organización del oferente

# resource.reference.contract_in_awards.name
source: Award reference
es: Referencia a la adjudicación

# resource.coherent.period.description
source: For each period, startDate is less than or equal to endDate. Since the test operates on all period objects, the test silently ignores any dates that can't be parsed.
es: Para cada período, startDate es menor o igual que endDate. Dado que la prueba opera en todos los objetos de período, silenciosamente ignora cualquier fecha que no pueda ser analizada.

# resource.coherent.procurement_method_vs_number_of_tenderers.description
source: If the tender.procurementMethod is 'direct', then the tender.numberOfTenderers is at most 1.
es: Si tender.procurementMethod es 'direct', entonces tender.numberOfTenderers es como máximo 1.

# resource.coherent.tender_status.description
source: If tender.status is incomplete ('planning', 'planned', 'active', 'cancelled', 'unsuccessful' or 'withdrawn'), then awards and contracts are blank.
es: Si tender.status está incompleto ('planning', 'planned', 'active', 'cancelled', 'unsuccessful' or 'withdrawn'), entonces las adjudicaciones y los contratos están en blanco.

# resource.coherent.awards_status.description
source: If an award's status is inactive ('pending', 'cancelled', 'unsuccessful'), then no contract's awardID matches the award's id.
es: Si el estado de una adjudicación es inactivo ('pending', 'cancelled', 'unsuccessful'), entonces ningún awardID de contratos coincide con el id de la adjudicación.

# resource.coherent.contracts_status.description
source: If a contract's status is unsigned ('pending' or 'cancelled'), then its implementation.transactions is blank.
es: Si el estado de un contrato no está firmado ('pending' o 'cancelled'), entonces su implementation.transactions está en blanco.

# resource.coherent.milestone_status.description
source: If a milestone's status is unmet ('scheduled' or 'notMet'), then its dateMet is blank.
es: Si el estado de un hito es unmet ('scheduled' o 'notMet'), entonces su dateMet está en blanco.

# resource.coherent.value_realistic.description
source: Each monetary value is between -5 billion USD and +5 billion USD. Since the test operates on all value objects, the test silently ignores any missing or non-numeric amounts and any missing or unknown currencies. If currency conversion is necessary, but the release date is invalid, before 1999, or in the future, the test silently ignores the value.
es: Cada valor monetario está entre -5 mil millones de USD y +5 mil millones de USD. Dado que la prueba opera en todos los objetos del tipo valor, la prueba ignora cualquier monto faltante o no numérico y cualquier moneda faltante o desconocida. Si es necesaria la conversión de moneda, pero la fecha de publicación no es válida, antes de 1999 o en el futuro, la prueba ignora el valor.

# resource.coherent.dates.description
source: All dates relating to stages of the contracting process follow a coherent timeline. - tender.tenderPeriod.endDate <= tender.contractPeriod.startDate: The last day for submissions isn't after the contract's anticipated start date. - tender.tenderPeriod.endDate <= awards[].date: The last day for submissions isn't after an award's date. - tender.tenderPeriod.endDate <= contracts[].dateSigned: The last day for submissions isn't after a contract's signature date. - awards[i].date <= contracts[].dateSigned: An award's date isn't after the signature date of any of its related contracts. - contracts[].dateSigned <= contracts[].implementation.transactions[].date: A contract's signature date isn't after the date of any of its related transactions. Also, each award's date and each contract's dateSigned aren't after the release date. Since the test operates on multiple dates, the test silently ignores any dates that can't be parsed.
es: Todas las fechas relacionadas a las etapas del proceso de contratación siguen una línea de tiempo coherente. - tender.tenderPeriod.endDate <= tender.contractPeriod.startDate: El último día para las presentaciones no es posterior al inicio anticipado del contrato. - tender.tenderPeriod.endDate <= awards[].date: El último día para las presentaciones no es posterior a la fecha de adjudicación. - tender.tenderPeriod.endDate <= contracts[].dateSigned: El último día para las presentaciones no es posterior a la fecha de firma de contrato. - awards[i].date <= contracts[].dateSigned: La fecha de adjudicación no es posterior a ninguna de las fechas de firma de los contratos relacionados. - contracts[].dateSigned <= contracts[].implementation.transactions[].date: La fecha de la firma de un contrato no es posterior ninguna de las fechas de las transacciones relacionadas. También, cada date de adjudicación y cada dateSigned del contrato no es posterior a la fecha del release. Dado que la prueba opera en múltiples fechas, silenciosamente ignora cualquier fecha que no pueda ser analizada.

# resource.coherent.milestones_dates.description
source: For each milestone, dateModified and dateMet aren't after the release date. Since the test operates on all milestone objects, the test silently ignores any dates that can't be parsed.
es: Para cada hito, dateModified y dateMet no son posteriores a la fecha del release. Dado que la prueba opera en todos los objetos hito, ignora silenciosamente cualquier fecha que no pueda ser analizada.

# resource.coherent.amendments_dates.description
source: For each amendment, date isn't after the release date, and: a tender amendment's date isn't before the tenderPeriod; an award amendment's date isn't before the award's date; a contract amendment's date isn't before the contract's dateSigned. Since the test operates on all amendment objects, the test silently ignores any dates that can't be parsed.
es: Para cada enmienda, date no es posterior a la fecha de release, y: date de enmienda de la licitación no es anterior a tenderPeriod; date de enmienda de la adjudicación no es anterior a date de adjudicación; date de enmienda del contrato no es anterior a dateSigned del contrato. Dado que la prueba opera en todos los objetos enmienda, ignora silenciosamente cualquier fecha que no puede ser analizada.

# resource.coherent.documents_dates.description
source: For each document, datePublished and dateModified aren't after the release date, and datePublished isn't after dateModified. Since the test operates on all document objects, the test silently ignores any dates that can't be parsed.
es: Para cada documento, datePublished y dateModified no son posteriores a la fecha de release, y datePublished no es posterior a dateModified. Dado que la prueba opera en todos los objetos documento, ignora silenciosamente todas las fechas que no pueden ser analizadas.

# resource.consistent.number_of_tenderers.description
source: The value of the numberOfTenderers field is equal to the number of entries in the tenderers array. The test is skipped if the tenderers field is not an array.
es: El valor del campo numberOfTenderers es igual al número de entradas en en el array de tenderers. La prueba se omite si el campo tenderers no es un array.

# resource.consistent.tender_value.description
source: planning.budget.amount isn't less than 50%, or more than 150%, of tender.value, after conversion to USD if necessary. The test is skipped if an amount is missing, zero or non-numeric, if a currency is missing or unknown, if the two amounts aren't both positive or both negative, or if currency conversion is necessary and the release date is invalid, before 1999, or in the future.
es: planning.budget.amount no es menos que el 50%, o más que el 150%, de tender.value, después de la conversión a USD si es necesario. La prueba es omitida si un monto no se encuentra, es cero o no numérico, si la moneda no se encuentra o es desconocida, si los dos montos no son ambos positivos o ambos negativos, si es necesaria la conversión de la moneda y si la fecha de release es inválida, anterior a 1999 o en el futuro.

# resource.consistent.contracts_value.description
source: For each award, the sum of its contract's values isn't less than 50%, or more than 150%, of the award's value, after conversion to USD if necessary. Since the test operates on all award and contract values, the test silently ignores any contract whose awardID doesn't match the id of exactly one award, if an amount is missing, zero or non-numeric, if a currency is missing or unknown, if the two amounts aren't both positive or both negative, or if currency conversion is necessary and the release date is invalid, before 1999, or in the future.
es: Para cada adjudicación, la suma de los valores de sus contratos no puede ser menor al 50% o mayor al 150% del valor de la adjudicación, después de la conversión a USD si es necesario. Dado que la prueba opera en todas las adjudicaciones y valores de contrato, silenciosamente ignora todos los awardID que no coinciden con exactamente un id de una adjudicación, si el monto no se encuentra, es cero o no numérico, si la moneda no se encuentra o es desconocida, si los dos montos no son ambos positivos o ambos negativos, si es necesaria la conversión de la moneda y si la fecha del release es invalida, anterior a 1999 o en el futuro.

# resource.consistent.contracts_implementation_transactions_value.description
source: For each contract, the sum of its transaction's values is less than or equal to the contract's value, after conversion to USD if necessary. Since the test operates on all contract and transaction objects, the test silently ignores any missing or non-numeric amounts and any missing or unknown currencies. If currency conversion is necessary, but the release date is invalid, before 1999, or in the future, the test silently ignores the contract and its transactions.
es: Para cada contrato, la suma de los valores de las transacciones es menor o igual al valor del contrato, después de la conversión a USD si es necesario. Dado que la prueba opera en todos los objetos contrato y transacción, silenciosamente ignora cualquier monto no encontrado, no numérico y cualquier moneda no encontrada o desconocida. Si es necesaria la conversión de la moneda, pero la fecha de release es inválida, antes de 1999 o en el futuro, la prueba ignora silenciosamente los contratos y sus transacciones.

# resource.consistent.parties_roles.description
source: For each role of each party, there is a referencing object. Example: If a party has the roles 'supplier' and 'payee', it is referenced by at least one award's suppliers entry and at least one transaction's payee field. The roles to test are: - procuringEntity - tenderer - supplier - payer - payee The 'buyer' role is not tested, because there can be multiple buyers in the parties array, but there is only one buyer field for the primary buyer. Since the test operates on all organization objects, the test silently ignores any party whose id field is missing, as it cannot be referenced.
es: Para cada rol de cada parte involucrada, hay un objeto de referencia. Por ejemplo: Si una parte tiene los roles 'supplier' y 'payee', es referenciada por al menos una entrada en suppliers de una adjudicación y al menos un campo payee de una transacción. Los roles a probarse son: - procuringEntity - tenderer - supplier - payer - payee El rol 'buyer' no se prueba porque pueden haber múltiples compradores en el array de parties, pero hay un solo campo buyer para el comprador primario. Dado que la prueba opera en todos los objetos organización, silenciosamente ignora cualquier parte involucrada en la cual no se encuentre el campo id, ya que no puede ser referenciado.

# resource.consistent.period_duration_in_days.description
source: For each period, durationInDays is equal to the difference between startDate and endDate. If endDate is blank or unparseable, then durationInDays is equal to the difference between startDate and maxExtentDate. Since the test operates on all period objects, the test silently ignores any dates that can't be parsed.
es: Para cada periodo, durationInDays es igual a la diferencia entre startDate y endDate. Si endDate está en blanco o no se puede analizar, entonces durationInDatys es igual a la diferencia entre startDate and maxExtentDate. Dado que la prueba opera en todos los objetos periodo, silenciosamente ignora cualquier fecha que no pueda ser analizada.

# resource.consistent.buyer_in_parties_roles.description
source: The party referenced by the buyer field has 'buyer' in its roles array.
es: La parte involucrada referenciada por el campo buyer tiene 'buyer' en su array de roles.

# resource.consistent.supplier_in_parties_roles.description
source: Each party referenced by a awards[].suppliers entry has 'supplier' in its roles array.
es: Cada parte involucrada referenciada en awards[].suppliers tiene 'supplier' en su array de roles.

# resource.consistent.tenderer_in_parties_roles.description
source: Each party referenced by a tender.tenderers entry has 'tenderer' in its roles array.
es: Cada parte involucrada referenciada en tender.tenderers tiene 'tenderer' en su array de roles.

# resource.consistent.procuring_entity_in_parties_roles.description
source: The party referenced by the tender.procuringEntity field has 'procuringEntity' in its roles array.
es: La parte involucrada referenciada por el campo tender.procuringEntity tiene el rol 'procuringEntity' en su array de roles.

# resource.consistent.payer_in_parties_roles.description
source: Each party referenced by a contracts[].implementation.transactions[].payer field has 'payer' in its roles array.
es: Cada parte involucrada referenciada por un campo contracts[].implementation.transactions[].payer tiene 'payer' en su array de roles.

# resource.consistent.payee_in_parties_roles.description
source: Each party referenced by a contracts[].implementation.transactions[].payee field has 'payee' in its roles array.
es: Cada parte referenciada por el campo contracts[].implementation.transactions[].payee tiene 'payee' en su array de roles.
