Repository: open-contracting/pelican-frontend
Catalog: backend/dqt/locale/*/LC_MESSAGES/django.po
Languages: es

# resource.consistent.buyer_name_in_parties.description
source: The buyer field has the same value for its name field as the party it references. The test is skipped if the referencing id is missing or if it doesn't match the id of exactly one party.
es: El campo buyer tiene en su campo name el mismo valor que la parte a la que referencia. La prueba es omitida si el id de referencia no se encuentra o si no coincide exactamente con el id de una parte involucrada.

# resource.consistent.payee_name_in_parties.description
source: Each contracts[].implementation.transactions[].payee field has the same value for its name field as the party it references. The test is skipped if every referencing id is missing or if none matches the id of exactly one party.
es: Cada campo contracts[].implementation.transactions[].payee tiene en el campo name el mismo valor que la parte a la que referencia. La prueba se omite si no se encuentran todos los id referenciados o si el id no coincide exactamente con el de una parte involucrada.

# resource.consistent.payer_name_in_parties.description
source: Each contracts[].implementation.transactions[].payer field has the same value for its name field as the party it references. The test is skipped if every referencing id is missing or if none matches the id of exactly one party.
es: Cada campo contracts[].implementation.transactions[].payer tiene en el campo name el mismo valor que la parte a la que referencia. La prueba se omite si no se encuentran todos los id referenciados o si ninguno coincide exactamente con una parte involucrada.

# resource.consistent.procuring_entity_name_in_parties.description
source: The tender.procuringEntity field has the same value for its name field as the party it references. The test is skipped if the referencing id is missing or if it doesn't match the id of exactly one party.
es: El campo tender.procuringEntity tiene en el campo name el mismo valor que la parte a la que referencia. La prueba se omite si el id referenciado no se encuentra o si el id no coincide exactamente con el de una parte involucrada.

# resource.consistent.supplier_name_in_parties.description
source: Each awards[].suppliers entry has the same value for its name field as the party it references. The test is skipped if every referencing id is missing or if none matches the id of exactly one party.
es: Cada entrada en awards[].suppliers tiene en el campo name el mismo valor que la parte a la que referencia. La prueba se omite si no se encuentran todos los id referenciados o si ninguno coincide exactamente con una parte involucrada.

# resource.consistent.tenderer_name_in_parties.description
source: Each tender.tenderers entry has the same value for its name field as the party it references. The test is skipped if every referencing id is missing or if none matches the id of exactly one party.
es: Cada entrada en tender.tenderers tiene en su campo name el mismo valor que la parte a la que referencia. La prueba se omite si no se encuentran todos los id referenciados o si ninguno coincide exactamente con una parte involucrada.

# resource.reference.buyer_in_parties.description
source: buyer.id is present and matches the id of exactly one party.
es: buyer.id está presente y coincide con el id de exactamente una parte involucrada.

# resource.reference.payee_in_parties.description
source: Every contracts[].implementation.transactions[].payee.id is present and matches the id of exactly one party.
es: Cada contracts[].implementation.transactions[].payee.id está presente y coincide con el id de exactamente una parte involucrada.

# resource.reference.payer_in_parties.description
source: Every contracts[].implementation.transactions[].payer.id is present and matches the id of exactly one party.
es: Cada contracts[].implementation.transactions[].payer.id está presente y coincide con el id de exactamente una parte involucrada.

# resource.reference.procuring_entity_in_parties.description
source: tender.procuringEntity.id is present and matches the id of exactly one party.
es: tender.procuringEntity.id está presente y coincide con el id de exactamente una parte involucrada.

# resource.reference.supplier_in_parties.description
source: Each awards[].suppliers[].id is present and matches the id of exactly one party.
es: Cada awards[].suppliers[].id está presente y coincide con el id de exactamente una parte involucrada.

# resource.reference.tenderer_in_parties.description
source: Each tender.tenderers[].id is present and matches the id of exactly one party.
es: Cada tender.tenderers[].id está presente y coincide con el id de exactamente una parte involucrada.

# resource.reference.contract_in_awards.description
source: Each contracts[].awardID is present and matches the awardID of exactly one award. The test is skipped if there are no awards.
es: Cada contracts[].awardID está presente y coincide con el awardID de exactamente una adjudicación. Esta prueba se omite si no hay adjudicaciones.

# dataset.distribution.main_procurement_category.name
source: Main procurement category distribution
es: Distribución de la categoría principal de contratación

# dataset.distribution.tender_status.name
source: Tender status distribution
es: Distribución del estado de licitación

# dataset.distribution.tender_procurement_method.name
source: Procurement method distribution
es: Distribución del método de contratación

# dataset.distribution.tender_award_criteria.name
source: Award criteria distribution
es: Distribución del criterio de adjudicación

# dataset.distribution.tender_submission_method.name
source: Submission method distribution
es: Distribución del método de presentación

# dataset.distribution.awards_status.name
source: Award status distribution
es: Distribución del estado de adjudicación

# dataset.distribution.contracts_status.name
source: Contract status distribution
es: Distribución del estado del contrato

# dataset.distribution.milestone_status.name
source: Milestone status distribution
es: Distribución del estado del hito

# dataset.distribution.milestone_type.name
source: Milestone type distribution
es: Distribución del tipo de hito

# dataset.distribution.document_document_type.name
source: Document type distribution
es: Distribución del tipo de documento

# dataset.distribution.value_currency.name
source: Currency distribution
es: Distribución de la moneda

# dataset.distribution.related_process_relation.name
source: Related process relation distribution
es: Distribución de la relación de los procesos relacionados

# dataset.distribution.tender_value.name
source: Tender value distribution
es: Distribución del valor de licitación

# dataset.distribution.contracts_value.name
source: Contracts value distribution
es: Distribución del valor de los contratos

# dataset.distribution.awards_value.name
source: Awards value distribution
es: Distribución del valor de las adjudicaciones

# dataset.misc.url_availability.name
source: URL availability
es: Disponibilidad de la URL

# dataset.unique.tender_id.name
source: Unique tender identification
es: Identificación única de licitación

# dataset.consistent.related_process_title.name
source: Tender's title is consistent
es: El título de la licitación es consistente

# dataset.reference.related_process_identifier.name
source: Related process reference
es: Referencia al proceso relacionado

# dataset.distribution.tender_value_repetition.name
source: Tender value repetition
es: Repetición del valor de licitación

# dataset.distribution.contracts_value_repetition.name
source: Contracts value repetition
es: Repetición del valor de los contratos

# dataset.distribution.awards_value_repetition.name
source: Awards value repetition
es: Repetición del valor de las adjudicaciones

# dataset.distribution.buyer_repetition.name
source: Buyer repetition
es: Repetición de comprador

# dataset.distribution.buyer.name
source: Buyer distribution
es: Distribución de comprador

# dataset.distribution.main_procurement_category.description
source: Visualizes the distribution of tender.mainProcurementCategory values. No code occurs in more than 95% of cases. The test is skipped if the field is never present. The codelist is closed.
es: Visualiza la distribución de los valores de tender.mainProcurementCategory. Ningún código aparece en más del 95% de los casos.

# dataset.distribution.tender_status.description
source: Visualizes the distribution of tender.status values. The 'active' and 'complete' codes each occur in between 0.1% and 99% of cases. The test is skipped if the field is never present. The codelist is closed.
es: Visualiza la distribución de los valores de tender.status. Los códigos 'active' y 'complete' aparecen cada uno entre el 0,1% y el 99% de los casos.

# dataset.distribution.tender_procurement_method.description
source: Visualizes the distribution of tender.procurementMethod values. The 'open' code occurs in between 0.1% and 99% of cases. The test is skipped if the field is never present. The codelist is closed.
es: Visualiza la distribución de los valores de tender.procurementMethod. El código 'open' aparece entre el 0,1% y el 99% de los casos.

# dataset.distribution.tender_award_criteria.description
source: Visualizes the distribution of tender.awardCriteria values. No test is performed. The codelist is open.
es: Visualiza la distribución de los valores de tender.awardCriteria. No se realiza ninguna prueba.

# dataset.distribution.tender_submission_method.description
source: Visualizes the distribution of tender.submissionMethod values. No test is performed. The codelist is open.
es: Visualiza la distribución de los valores de tender.submissionMethod. No se realiza ninguna prueba.

# dataset.distribution.awards_status.description
source: Visualizes the distribution of awards.status values. The 'active' code occurs in between 0.1% and 99% of cases. The test is skipped if the field is never present. The codelist is closed.
es: Visualiza la distribución del valor de awards.status. El código 'active' aparece entre el 0,1% y el 99% de los casos.

# dataset.distribution.contracts_status.description
source: Visualizes the distribution of contracts.status values. The 'active' and 'terminated' codes each occur in between 0.1% and 99% of cases. The test is skipped if the field is never present. The codelist is closed.
es: Visualiza la distribución de los valores de contracts.status. Los códigos 'active' y 'terminated' cada uno aparecen entre el 0,1% y el 99% de los casos.

# dataset.distribution.milestone_status.description
source: Visualizes the distribution of milestone status values. The 'met' code occurs in between 0.1% and 99% of cases. The milestone fields are: - planning.milestones.status - tender.milestones.status - awards.milestones.status - contracts.implementation.milestones.status The test is skipped if the field is never present. The codelist is closed.
es: Visualiza la distribución de los valores de status de los hitos. El código 'met' aparecen entre el 0,1% y el 99% de los casos.

# dataset.distribution.milestone_type.description
source: Visualizes the distribution of milestone type values. No test is performed. The milestone fields are: - planning.milestones.type - tender.milestones.type - awards.milestones.type - contracts.implementation.milestones.type The codelist is open.
es: Visualiza la distribución de los valores de type de los hitos. No se realiza ninguna prueba.

# dataset.distribution.document_document_type.description
source: Visualizes the distribution of document documentType values. No test is performed. The document fields are: - planning.documents.documentType - tender.documents.documentType - awards.documents.documentType - contracts.documents.documentType - contracts.implementation.documents.documentType The codelist is open.
es: Visualiza la distribución de los valores de documentType de documento. No se realiza ninguna prueba.

# dataset.distribution.value_currency.description
source: Visualizes the distribution of currency values. No test is performed. The fields are: - planning.budget.value.currency - tender.value.currency - tender.minValue.currency - awards.value.currency - contracts.value.currency - contracts.implementation.transactions.value.currency The codelist is closed.
es: Visualiza la distribución de los valores de currency. No se realiza ninguna prueba.

# dataset.distribution.related_process_relation.description
source: Visualizes the distribution of relatedProcesses.relationship values. No test is performed. The codelist is open.
es: Visualiza la distribución de los valores de relatedProcesses.relationship. No se realiza ninguna prueba.

# dataset.distribution.tender_value.description
source: The sum of the top 1% of tender values doesn't exceed 50% of the sum of all tender values. Failure indicates extreme outliers in the top 1%. All values are converted to USD as of the compiled release's date. For illustration purposes, the shares of other ranges of values are shown. The test is skipped if fewer than 100 values are included. A value is excluded if an amount is missing or non-numeric, if a currency is missing or unknown, or if currency conversion is necessary and the release date is invalid, before 1999, or in the future.
es: La suma del 1% superior de valores de licitaciones no excede el 50% de la suma de todos los valores de licitaciones. El fallo indica valores atípicos extremos.

# dataset.distribution.contracts_value.description
source: The sum of the top 1% of contract values doesn't exceed 50% of the sum of all contract values. Failure indicates extreme outliers in the top 1%. All values are converted to USD as of the compiled release's date. For illustration purposes, the shares of other ranges of values are shown. The test is skipped if fewer than 100 values are included. A value is excluded if an amount is missing or non-numeric, if a currency is missing or unknown, or if currency conversion is necessary and the release date is invalid, before 1999, or in the future.
es: La suma del 1% superior de valores de contratos no excede el 50% de la suma de todos los valores de contrato. El fallo indica valores atípicos extremos.

# dataset.distribution.awards_value.description
source: The sum of the top 1% of award values doesn't exceed 50% of the sum of all award values. Failure indicates extreme outliers in the top 1%. All values are converted to USD as of the compiled release's date. For illustration purposes, the shares of other ranges of values are shown. The test is skipped if fewer than 100 values are included. A value is excluded if an amount is missing or non-numeric, if a currency is missing or unknown, or if currency conversion is necessary and the release date is invalid, before 1999, or in the future.
es: La suma del 1% superior de los valores de las adjudicaciones no excede el 50% de la suma de todos los valores de las adjudicaciones. El fallo indica valores atípicos extremos.

# dataset.misc.url_availability.description
source: A random sample of 100 URL values return no responses with HTTP error codes. The URL fields are: - planning.documents.url - tender.documents.url - awards.documents.url - contracts.documents.url
es: Una muestra aleatoria de 100 valores de URL no retornan respuestas con códigos de error HTTP.

# dataset.unique.tender_id.description
source: For each compiled release verifies that its tender.id is unique within the dataset. Such releases that do not have tender.id set are excluded from this calculation
es: tender.id es único dentro de todo el conjunto de datos

# dataset.consistent.related_process_title.description
source: A related process object has the same value for its title field as the tender.title field of the compiled release it references. The related process fields are: - contracts.relatedProcesses - relatedProcesses
es: Un objeto de un proceso relacionado tiene el mismo valor en su campo título que en su campo tender.title en el compiled release al que referencia.

# dataset.reference.related_process_identifier.description
source: If a related process has a scheme of 'ocid' and its identifier is present, then its identifier matches the ocid of a compiled release. The related process fields are: - contracts.relatedProcesses - relatedProcesses
es: Si un proceso relacionado tiene un esquema de 'ocid' y su identificador está presente, entonces su identificador coincide con el ocid de un compiled release.

# dataset.distribution.tender_value_repetition.description
source: Lists the 5 most frequent pairs of tender.value.amount and tender.value.currency. The 3 most frequent pairs appear in fewer than 10% of cases. The test is skipped if ther are no pairs.
es: Lista los 5 pares más frecuentes de tender.value.amount y tender.value.currency. Los 3 pares más frecuentes aparecen en un poco menos que el 10% de los casos.

# dataset.distribution.contracts_value_repetition.description
source: Lists the 5 most frequent pairs of contracts.value.amount and contracts.value.currency. The 3 most frequent pairs appear in fewer than 10% of cases. The test is skipped if ther are no pairs.
es: Lista los 5 pares más frecuentes de contracts.value.amount y contracts.value.currency. Los 3 pares más frecuentes aparecen en un poco menos que el 10% de los casos.

# dataset.distribution.awards_value_repetition.description
source: Lists the 5 most frequent pairs of awards.value.amount and awards.value.currency. The 3 most frequent pairs appear in fewer than 10% of cases. The test is skipped if ther are no pairs.
es: Lista los 5 pares más frecuentes de awards.value.amount y awards.value.currency. Los 3 pares más frecuentes aparecen en un poco menos que el 10% de los casos.

# dataset.distribution.buyer_repetition.description
source: The most common buyer is identified in 1% to 50% of compiled releases. Failure indicates issues in buyer identification or buyer over-representation. Buyers are identified by buyer.identifier.scheme and buyer.identifier.id. The test is skipped if the buyer.identifier.scheme and buyer.identifier.id fields are both present in fewer than 1,000 compiled releases.
es: El comprador más común es identificado en el 1% al 50% de los compiled releases. El fallo indica problemas en el identificador del comprador o sobre-representación del comprador.

# dataset.distribution.buyer.description
source: Fewer than 50% of all buyers are identified in only one compiled release. Failure indicates issues in buyer identification. Buyers are identified by buyer.identifier.scheme and buyer.identifier.id. For illustration purposes, the share of all buyers identified in other numbers of compiled releases is shown. The test is skipped if the buyer.identifier.scheme and buyer.identifier.id fields are both present in fewer than 1,000 compiled releases.
es: Poco más del 50% de todos los compradores son identificados solo en un compiled release. El fallo indica problemas en la identificación del comprador.
