Repository: open-contracting/pelican-frontend
Catalog: exporter/locale/*/LC_MESSAGES/django.po
Languages: es

source: field.exists.description
es: Hay una prueba por posible aparición del campo. Ejemplo: si el campo padre licitación se establece en 10 compiled releases, el campo hijo tender.id se reporta sobre 10. Si hay 100 entradas en todos los arrays de adjudicación en todos los compiled releases, entonces se reporta el campo awards.id sobre 100.

source: field.non_empty.description
es: Hay una prueba por ocurrencia real del campo. La prueba pasa si el valor del campo no es nulo ni está vacío (es decir, no es una cadena vacía, un array vacío o un objeto vacío). Vea la comprobación de arriba para obtener más detalles.

source: field.exists.name
es: El campo está establecido

source: field.non_empty.name
es: El campo no es nulo ni está vacío

source: field.ocid_prefix_check.name
es: El prefijo OCID está registrado

source: field.date_time.name
es: La fecha es realista

source: field.email.name
es: La dirección de correo electrónico es válida

source: field.identifier_scheme.name
es: El esquema del identificador es reconocido

source: field.telephone.name
es: El número de teléfono es posible

source: field.document_description_length.name
es: Tiene 250 caracteres o menos

source: field.document_type.name
es: El tipo de documento es coherente

source: field.document_format_codelist.name
es: El formato del documento es reconocido

source: field.number_checks.name
es: El número no es negativo

source: field.language.name
es: El código del idioma es reconocido

source: field.ocid_prefix_check.description
es: El valor es una cadena y comienza con un prefijo OCID registrado.

source: field.date_time.description
es: El valor es una cadena, comienza en formato AAAA-MM-DD y no es anterior a 1990 ni posterior a 2050.

source: field.email.description
es: El valor es una dirección válida según RFC 2822.

source: field.identifier_scheme.description
es: El valor es una cadena y es un código org-id.guide. (La lista de códigos es abierta.)

source: field.telephone.description
es: El valor es un número posible según la libreria libphonenumber de Google.

source: field.document_description_length.description
es: La longitud del valor es menor o igual a 250.

source: field.document_type.description
es: El tipo de documento es apropiado para la ruta del campo. Específicamente, el valor es un código de documentType y la 'Sección' del código corresponde a la ruta del campo. (La lista de códigos es abierta.)

source: field.document_format_codelist.description
es: El valor es una cadena y o es un tipo de medio IANA o es el código 'offline/print'. (La lista de códigos es abierta.)

source: field.number_checks.description
es: El valor no es un número complejo, puede ser analizado como un número de punto flotante y no es negativo.

source: field.language.description
es: El valor es una cadena y es un código ISO 639-1 de dos letras minúsculas. (La lista de códigos es abierta.)

source: resource.coherent.period.name
es: Las fechas de inicio no son posteriores a la fechas de fin

source: resource.coherent.procurement_method_vs_number_of_tenderers.name
es: Como máximo un licitador para la contratación de una sola fuente

source: resource.coherent.tender_status.name
es: Sin adjudicaciones o contratos en licitaciones incompletas

source: resource.coherent.awards_status.name
es: Sin contratos en adjudicaciones inactivas

source: resource.coherent.contracts_status.name
es: Sin transacciones en contratos no firmados

source: resource.coherent.milestone_status.name
es: Sin fecha de cumplimiento en hitos no cumplidos

source: resource.coherent.value_realistic.name
es: Los valores monetarios son realistas

source: resource.coherent.dates.name
es: Línea de tiempo del proceso de contratación

source: resource.coherent.milestones_dates.name
es: Fechas de hito

source: resource.coherent.amendments_dates.name
es: Fechas de enmienda

source: resource.coherent.documents_dates.name
es: Fechas de documento

source: resource.consistent.number_of_tenderers.name
es: El número de oferentes es consistente

source: resource.consistent.tender_value.name
es: El presupuesto de la planificación está acorde con el valor de la licitación

source: resource.consistent.contracts_value.name
es: Los valores del contrato están acordes al valor de la adjudicación

source: resource.consistent.contracts_implementation_transactions_value.name
es: Los valores de transacción son proporcionales al valor del contrato

source: resource.consistent.parties_roles.name
es: Las partes son referenciadas

source: resource.consistent.period_duration_in_days.name
es: La duración del periodo es consistente con la fecha de inicio y fin

source: resource.consistent.buyer_in_parties_roles.name
es: El rol del comprador está establecido

source: resource.consistent.supplier_in_parties_roles.name
es: El rol del proveedor está establecido

source: resource.consistent.tenderer_in_parties_roles.name
es: El rol del oferente está establecido

source: resource.consistent.procuring_entity_in_parties_roles.name
es: El rol de la entidad contratante está establecido

source: resource.consistent.payer_in_parties_roles.name
es: El rol del pagador está establecido

source: resource.consistent.payee_in_parties_roles.name
es: El rol del beneficiario está establecido

source: resource.consistent.buyer_name_in_parties.name
es: El nombre del comprador es consistente

source: resource.consistent.payee_name_in_parties.name
es: El nombre del beneficiario es consistente

source: resource.consistent.payer_name_in_parties.name
es: El nombre del pagador es consistente

source: resource.consistent.procuring_entity_name_in_parties.name
es: El nombre de la entidad contratante es consistente

source: resource.consistent.supplier_name_in_parties.name
es: El nombre del proveedor es consistente

source: resource.consistent.tenderer_name_in_parties.name
es: El nombre del oferente es consistente

source: resource.reference.buyer_in_parties.name
es: Referencia a la organización del comprador

source: resource.reference.payee_in_parties.name
es: Referencia a la organización del beneficiario

source: resource.reference.payer_in_parties.name
es: Referencia a la organización del pagador

source: resource.reference.procuring_entity_in_parties.name
es: Referencia a la organización de la entidad contratante

source: resource.reference.supplier_in_parties.name
es: Referencias a la organización del proveedor

source: resource.reference.tenderer_in_parties.name
es: Referencias a la organización del oferente

source: resource.reference.contract_in_awards.name
es: Referencia a la adjudicación

source: resource.coherent.period.description
es: Para cada período, startDate es menor o igual que endDate. Dado que la prueba opera en todos los objetos de período, silenciosamente ignora cualquier fecha que no pueda ser analizada.

source: resource.coherent.procurement_method_vs_number_of_tenderers.description
es: Si tender.procurementMethod es 'direct', entonces tender.numberOfTenderers es como máximo 1.

source: resource.coherent.tender_status.description
es: Si tender.status está incompleto ('planning', 'planned', 'active', 'cancelled', 'unsuccessful' or 'withdrawn'), entonces las adjudicaciones y los contratos están en blanco.

source: resource.coherent.awards_status.description
es: Si el estado de una adjudicación es inactivo ('pending', 'cancelled', 'unsuccessful'), entonces ningún awardID de contratos coincide con el id de la adjudicación.

source: resource.coherent.contracts_status.description
es: Si el estado de un contrato no está firmado ('pending' o 'cancelled'), entonces su implementation.transactions está en blanco.

source: resource.coherent.milestone_status.description
es: Si el estado de un hito es unmet ('scheduled' o 'notMet'), entonces su dateMet está en blanco.

source: resource.coherent.value_realistic.description
es: Cada valor monetario está entre -5 mil millones de USD y +5 mil millones de USD. Dado que la prueba opera en todos los objetos del tipo valor, la prueba ignora cualquier monto faltante o no numérico y cualquier moneda faltante o desconocida. Si es necesaria la conversión de moneda, pero la fecha de publicación no es válida, antes de 1999 o en el futuro, la prueba ignora el valor.

source: resource.coherent.dates.description
es: Todas las fechas relacionadas a las etapas del proceso de contratación siguen una línea de tiempo coherente. - tender.tenderPeriod.endDate <= tender.contractPeriod.startDate: El último día para las presentaciones no es posterior al inicio anticipado del contrato. - tender.tenderPeriod.endDate <= awards[].date: El último día para las presentaciones no es posterior a la fecha de adjudicación. - tender.tenderPeriod.endDate <= contracts[].dateSigned: El último día para las presentaciones no es posterior a la fecha de firma de contrato. - awards[i].date <= contracts[].dateSigned: La fecha de adjudicación no es posterior a ninguna de las fechas de firma de los contratos relacionados. - contracts[].dateSigned <= contracts[].implementation.transactions[].date: La fecha de la firma de un contrato no es posterior ninguna de las fechas de las transacciones relacionadas. También, cada date de adjudicación y cada dateSigned del contrato no es posterior a la fecha del release. Dado que la prueba opera en múltiples fechas, silenciosamente ignora cualquier fecha que no pueda ser analizada.

source: resource.coherent.milestones_dates.description
es: Para cada hito, dateModified y dateMet no son posteriores a la fecha del release. Dado que la prueba opera en todos los objetos hito, ignora silenciosamente cualquier fecha que no pueda ser analizada.

source: resource.coherent.amendments_dates.description
es: Para cada enmienda, date no es posterior a la fecha de release, y: date de enmienda de la licitación no es anterior a tenderPeriod; date de enmienda de la adjudicación no es anterior a date de adjudicación; date de enmienda del contrato no es anterior a dateSigned del contrato. Dado que la prueba opera en todos los objetos enmienda, ignora silenciosamente cualquier fecha que no puede ser analizada.

source: resource.coherent.documents_dates.description
es: Para cada documento, datePublished y dateModified no son posteriores a la fecha de release, y datePublished no es posterior a dateModified. Dado que la prueba opera en todos los objetos documento, ignora silenciosamente todas las fechas que no pueden ser analizadas.

source: resource.consistent.number_of_tenderers.description
es: El valor del campo numberOfTenderers es igual al número de entradas en en el array de tenderers. La prueba se omite si el campo tenderers no es un array.

source: resource.consistent.tender_value.description
es: planning.budget.amount no es menos que el 50%, o más que el 150%, de tender.value, después de la conversión a USD si es necesario. La prueba es omitida si un monto no se encuentra, es cero o no numérico, si la moneda no se encuentra o es desconocida, si los dos montos no son ambos positivos o ambos negativos, si es necesaria la conversión de la moneda y si la fecha de release es inválida, anterior a 1999 o en el futuro.

source: resource.consistent.contracts_value.description
es: Para cada adjudicación, la suma de los valores de sus contratos no puede ser menor al 50% o mayor al 150% del valor de la adjudicación, después de la conversión a USD si es necesario. Dado que la prueba opera en todas las adjudicaciones y valores de contrato, silenciosamente ignora todos los awardID que no coinciden con exactamente un id de una adjudicación, si el monto no se encuentra, es cero o no numérico, si la moneda no se encuentra o es desconocida, si los dos montos no son ambos positivos o ambos negativos, si es necesaria la conversión de la moneda y si la fecha del release es invalida, anterior a 1999 o en el futuro.

source: resource.consistent.contracts_implementation_transactions_value.description
es: Para cada contrato, la suma de los valores de las transacciones es menor o igual al valor del contrato, después de la conversión a USD si es necesario. Dado que la prueba opera en todos los objetos contrato y transacción, silenciosamente ignora cualquier monto no encontrado, no numérico y cualquier moneda no encontrada o desconocida. Si es necesaria la conversión de la moneda, pero la fecha de release es inválida, antes de 1999 o en el futuro, la prueba ignora silenciosamente los contratos y sus transacciones.

source: resource.consistent.parties_roles.description
es: Para cada rol de cada parte involucrada, hay un objeto de referencia. Por ejemplo: Si una parte tiene los roles 'supplier' y 'payee', es referenciada por al menos una entrada en suppliers de una adjudicación y al menos un campo payee de una transacción. Los roles a probarse son: - procuringEntity - tenderer - supplier - payer - payee El rol 'buyer' no se prueba porque pueden haber múltiples compradores en el array de parties, pero hay un solo campo buyer para el comprador primario. Dado que la prueba opera en todos los objetos organización, silenciosamente ignora cualquier parte involucrada en la cual no se encuentre el campo id, ya que no puede ser referenciado.

source: resource.consistent.period_duration_in_days.description
es: Para cada periodo, durationInDays es igual a la diferencia entre startDate y endDate. Si endDate está en blanco o no se puede analizar, entonces durationInDatys es igual a la diferencia entre startDate and maxExtentDate. Dado que la prueba opera en todos los objetos periodo, silenciosamente ignora cualquier fecha que no pueda ser analizada.

source: resource.consistent.buyer_in_parties_roles.description
es: La parte involucrada referenciada por el campo buyer tiene 'buyer' en su array de roles.

source: resource.consistent.supplier_in_parties_roles.description
es: Cada parte involucrada referenciada en awards[].suppliers tiene 'supplier' en su array de roles.

source: resource.consistent.tenderer_in_parties_roles.description
es: Cada parte involucrada referenciada en tender.tenderers tiene 'tenderer' en su array de roles.

source: resource.consistent.procuring_entity_in_parties_roles.description
es: La parte involucrada referenciada por el campo tender.procuringEntity tiene el rol 'procuringEntity' en su array de roles.

source: resource.consistent.payer_in_parties_roles.description
es: Cada parte involucrada referenciada por un campo contracts[].implementation.transactions[].payer tiene 'payer' en su array de roles.

source: resource.consistent.payee_in_parties_roles.description
es: Cada parte referenciada por el campo contracts[].implementation.transactions[].payee tiene 'payee' en su array de roles.

source: resource.consistent.buyer_name_in_parties.description
es: El campo buyer tiene en su campo name el mismo valor que la parte a la que referencia. La prueba es omitida si el id de referencia no se encuentra o si no coincide exactamente con el id de una parte involucrada.

source: resource.consistent.payee_name_in_parties.description
es: Cada campo contracts[].implementation.transactions[].payee tiene en el campo name el mismo valor que la parte a la que referencia. La prueba se omite si no se encuentran todos los id referenciados o si el id no coincide exactamente con el de una parte involucrada.

source: resource.consistent.payer_name_in_parties.description
es: Cada campo contracts[].implementation.transactions[].payer tiene en el campo name el mismo valor que la parte a la que referencia. La prueba se omite si no se encuentran todos los id referenciados o si ninguno coincide exactamente con una parte involucrada.

source: resource.consistent.procuring_entity_name_in_parties.description
es: El campo tender.procuringEntity tiene en el campo name el mismo valor que la parte a la que referencia. La prueba se omite si el id referenciado no se encuentra o si el id no coincide exactamente con el de una parte involucrada.

source: resource.consistent.supplier_name_in_parties.description
es: Cada entrada en awards[].suppliers tiene en el campo name el mismo valor que la parte a la que referencia. La prueba se omite si no se encuentran todos los id referenciados o si ninguno coincide exactamente con una parte involucrada.

source: resource.consistent.tenderer_name_in_parties.description
es: Cada entrada en tender.tenderers tiene en su campo name el mismo valor que la parte a la que referencia. La prueba se omite si no se encuentran todos los id referenciados o si ninguno coincide exactamente con una parte involucrada.

source: resource.reference.buyer_in_parties.description
es: buyer.id está presente y coincide con el id de exactamente una parte involucrada.

source: resource.reference.payee_in_parties.description
es: Cada contracts[].implementation.transactions[].payee.id está presente y coincide con el id de exactamente una parte involucrada.

source: resource.reference.payer_in_parties.description
es: Cada contracts[].implementation.transactions[].payer.id está presente y coincide con el id de exactamente una parte involucrada.

source: resource.reference.procuring_entity_in_parties.description
es: tender.procuringEntity.id está presente y coincide con el id de exactamente una parte involucrada.

source: resource.reference.supplier_in_parties.description
es: Cada awards[].suppliers[].id está presente y coincide con el id de exactamente una parte involucrada.

source: resource.reference.tenderer_in_parties.description
es: Cada tender.tenderers[].id está presente y coincide con el id de exactamente una parte involucrada.

source: resource.reference.contract_in_awards.description
es: Cada contracts[].awardID está presente y coincide con el awardID de exactamente una adjudicación. Esta prueba se omite si no hay adjudicaciones.

source: dataset.distribution.main_procurement_category.name
es: Distribución de la categoría principal de contratación

source: dataset.distribution.tender_status.name
es: Distribución del estado de licitación

source: dataset.distribution.tender_procurement_method.name
es: Distribución del método de contratación

source: dataset.distribution.tender_award_criteria.name
es: Distribución del criterio de adjudicación

source: dataset.distribution.tender_submission_method.name
es: Distribución del método de presentación

source: dataset.distribution.awards_status.name
es: Distribución del estado de adjudicación

source: dataset.distribution.contracts_status.name
es: Distribución del estado del contrato

source: dataset.distribution.milestone_status.name
es: Distribución del estado del hito

source: dataset.distribution.milestone_type.name
es: Distribución del tipo de hito

source: dataset.distribution.document_document_type.name
es: Distribución del tipo de documento

source: dataset.distribution.value_currency.name
es: Distribución de la moneda

source: dataset.distribution.related_process_relation.name
es: Distribución de la relación de los procesos relacionados

source: dataset.distribution.tender_value.name
es: Distribución del valor de licitación

source: dataset.distribution.contracts_value.name
es: Distribución del valor de los contratos

source: dataset.distribution.awards_value.name
es: Distribución del valor de las adjudicaciones

source: dataset.misc.url_availability.name
es: Disponibilidad de la URL

source: dataset.unique.tender_id.name
es: Identificación única de licitación

source: dataset.consistent.related_process_title.name
es: El título de la licitación es consistente

source: dataset.reference.related_process_identifier.name
es: Referencia al proceso relacionado

source: dataset.distribution.tender_value_repetition.name
es: Repetición del valor de licitación

source: dataset.distribution.contracts_value_repetition.name
es: Repetición del valor de los contratos

source: dataset.distribution.awards_value_repetition.name
es: Repetición del valor de las adjudicaciones

source: dataset.distribution.buyer_repetition.name
es: Repetición de comprador

source: dataset.distribution.buyer.name
es: Distribución de comprador

source: dataset.distribution.main_procurement_category.description
es: Visualiza la distribución de los valores de tender.mainProcurementCategory. Ningún código aparece en más del 95% de los casos.

source: dataset.distribution.tender_status.description
es: Visualiza la distribución de los valores de tender.status. Los códigos 'active' y 'complete' aparecen cada uno entre el 0,1% y el 99% de los casos.

source: dataset.distribution.tender_procurement_method.description
es: Visualiza la distribución de los valores de tender.procurementMethod. El código 'open' aparece entre el 0,1% y el 99% de los casos.

source: dataset.distribution.tender_award_criteria.description
es: Visualiza la distribución de los valores de tender.awardCriteria. No se realiza ninguna prueba.

source: dataset.distribution.tender_submission_method.description
es: Visualiza la distribución de los valores de tender.submissionMethod. No se realiza ninguna prueba.

source: dataset.distribution.awards_status.description
es: Visualiza la distribución del valor de awards.status. El código 'active' aparece entre el 0,1% y el 99% de los casos.

source: dataset.distribution.contracts_status.description
es: Visualiza la distribución de los valores de contracts.status. Los códigos 'active' y 'terminated' cada uno aparecen entre el 0,1% y el 99% de los casos.

source: dataset.distribution.milestone_status.description
es: Visualiza la distribución de los valores de status de los hitos. El código 'met' aparecen entre el 0,1% y el 99% de los casos.

source: dataset.distribution.milestone_type.description
es: Visualiza la distribución de los valores de type de los hitos. No se realiza ninguna prueba.

source: dataset.distribution.document_document_type.description
es: Visualiza la distribución de los valores de documentType de documento. No se realiza ninguna prueba.

source: dataset.distribution.value_currency.description
es: Visualiza la distribución de los valores de currency. No se realiza ninguna prueba.

source: dataset.distribution.related_process_relation.description
es: Visualiza la distribución de los valores de relatedProcesses.relationship. No se realiza ninguna prueba.

source: dataset.distribution.tender_value.description
es: La suma del 1% superior de valores de licitaciones no excede el 50% de la suma de todos los valores de licitaciones. El fallo indica valores atípicos extremos.

source: dataset.distribution.contracts_value.description
es: La suma del 1% superior de valores de contratos no excede el 50% de la suma de todos los valores de contrato. El fallo indica valores atípicos extremos.

source: dataset.distribution.awards_value.description
es: La suma del 1% superior de los valores de las adjudicaciones no excede el 50% de la suma de todos los valores de las adjudicaciones. El fallo indica valores atípicos extremos.

source: dataset.misc.url_availability.description
es: Una muestra aleatoria de 100 valores de URL no retornan respuestas con códigos de error HTTP.

source: dataset.unique.tender_id.description
es: tender.id es único dentro de todo el conjunto de datos

source: dataset.consistent.related_process_title.description
es: Un objeto de un proceso relacionado tiene el mismo valor en su campo título que en su campo tender.title en el compiled release al que referencia.

source: dataset.reference.related_process_identifier.description
es: Si un proceso relacionado tiene un esquema de 'ocid' y su identificador está presente, entonces su identificador coincide con el ocid de un compiled release.

source: dataset.distribution.tender_value_repetition.description
es: Lista los 5 pares más frecuentes de tender.value.amount y tender.value.currency. Los 3 pares más frecuentes aparecen en un poco menos que el 10% de los casos.
