Repository: open-contracting/pelican-frontend
Catalog: exporter/locale/*/LC_MESSAGES/django.po
Languages: es

source: dataset.distribution.contracts_value_repetition.description
es: Lista los 5 pares más frecuentes de contracts.value.amount y contracts.value.currency. Los 3 pares más frecuentes aparecen en un poco menos que el 10% de los casos.

source: dataset.distribution.awards_value_repetition.description
es: Lista los 5 pares más frecuentes de awards.value.amount y awards.value.currency. Los 3 pares más frecuentes aparecen en un poco menos que el 10% de los casos.

source: dataset.distribution.buyer_repetition.description
es: El comprador más común es identificado en el 1% al 50% de los compiled releases. El fallo indica problemas en el identificador del comprador o sobre-representación del comprador.

source: dataset.distribution.buyer.description
es: Poco más del 50% de todos los compradores son identificados solo en un compiled release. El fallo indica problemas en la identificación del comprador.
